from .config import liechang_count

#成就别名
achievements_aliases = {
    "还是PVP大佬": ["还是pvp大佬", "pvp", "PVP"],
    "Madeline全收集": ["madeline全收集", "MADELINE全收集", "玛德琳全收集"],
    "气象专家": ["气象专家", "奇想专家", "奇效专家", "气笑专家"],
    "花园等级MAX": ["花园等级Max", "花园等级max"],
}

#成就系统，结构为：{成就名称：[等级，获取条件，描述]}
achievements = {
    '藏品全收集':
    [
        5,
        "收集齐所有的藏品\n（该成就获取难度会随时间增加，\n特殊藏品不算入，但是会减少难度）",
        '0.5%？0.3%？0.1%？\n都什么花里胡哨的，我全有了！'
    ],
    '道具全收集':
    [
        5,
        "收集齐所有的道具\n（该成就获取难度会随时间增加，\n绝版道具不算入，但是会减少难度）",
        '诶，阿拉胖头鱼你都有啦？\n不对，你到底有没有……'
    ],
    '签到背景全收集':
    [
        5,
        "收集齐所有的签到背景\n（该成就获取难度会随时间增加）",
        '富哥啊……VME50'
    ],
    'Madeline全收集':
    [
        5,
        f"收集齐已开放猎场的所有Madeline\n当前开放猎场数{liechang_count}\n（该成就获取难度会随时间增加）",
        '我去，抓Madeline领域大神！'
    ],
    '花园等级MAX':
    [
        5,
        "花园等级达到10级",
        '花了多少能量？100000，200000，还是300000？\n你究竟献祭了多少玛德琳啊……'
    ],
    '草莓大富翁':
    [
        4,
        "草莓存款（仓库内草莓）达到10w",
        '嘶……你究竟是存款存了多久……\n你现在可以吃满绝大部分的报酬了！'
    ],
    '还是PVP大佬':
    [
        4,
        "PVP相关道具/藏品全收集\n（该成就获取难度会随时间增加）",
        '你好，陌生人\n抓玛团队招生了\n无论你是爬山大神\n音游大师\n还是PVP大佬\n又或者是草莓囤积大佬\n还是PVP大佬\n还是PVP大佬\n还是PVP大佬\n又或者是hist大佬\n还是PVP大佬\n还是什么都不知道的抓玛萌新\n还是PVP大佬'
    ],
    '秘宝猎手':
    [
        4,
        "持有所有秘宝藏品\n（该成就获取难度会随时间增加）",
        '哼，秘宝，我全都要！'
    ],
    '防护专家':
    [
        4,
        "持有所有防爆藏品\n（该成就获取难度会随时间增加）",
        '只希望隔壁龟龟的玛德琳\n碰到那根淡紫色狐狸毛别再爆炸了……'
    ],
    '飞升器破坏者':
    [
        4,
        "完全解锁4猎",
        '此时你很想把这个飞升器砸了，对吧？'
    ],
    '练级狂魔':
    [
        4,
        "完全解锁5猎",
        '我还要继续升级！\n我还要更多，更多……'
    ],
    '气象专家':
    [
        3,
        "持有藏品[奇想魔盒]和[奇想扑克]",
        '当你无数次预言大师和抽卡……\n拿到了这黑色的盒子和白色的扑克牌后，\n你终于气笑了。'
    ],
}