__all__ = [
    'rabbit_madeline4',
    'madeline_name_list4',
    'madeline_data4'
]

rabbit_madeline4 = [
    [5, 13],
    [5, 3],
    [5, 1],
    [4, 3],
    [4, 6],
    [4, 21],
    [4, 5],
    [4, 1],
    [3, 8],
    [3, 9],
    [3, 1],
    [3, 3],
]

madeline_name_list4 = {
    '1':[
        '很舒服的玛德琳',
        '害怕玛德琳',
        '蒙眼玛德琳',
        '对话框',
        '酱一',
        '酱二',
        '酱三',
        '酱四',
        '酱五',
        '8旗动画',
        '象牙小船',
        '草莓酱通关动画',
        '小雨伞',
        '荷塘月色',
        '千空之寺',
        '意念力',
        'LEVEL UP',
        '红宝石',
        '黄玉',
        '珍珠',
        '星型宝石',
        '紫宝石',
        '青宝石',
        '粉云',
        '钥匙',
        '冰球',
        '开门',
        '伤心坏德琳',
        '苍渊冰芯',
        '赤核幼焰',
        '辉霆棱芯',
        '烬穹晶砂',
        '虚界星屑',
        '请选择你的拍屏导师',
        '现在是幻想时间',
        'summitstare',
        '酱一心“门”',
        'skate.ppt',
        '油桶',
        '草莓酱纪念碑',
        '我有抑郁症',
        '没人疼就去爬山吧',
        '全都是外星人！',
        '你的死亡次数',
        '给我玩蔚蓝',
    ],
    '2':[
        '水晶草莓',
        '水晶速通铜草莓',
        '水晶飞草莓',
        'Strawberry Jam',
        "概率论与数理统计",
        'Sapphire Ruins',
        '画游',
        '水莓',
        '紫色飞草莓',
        '速通爆炸',
        '核心草莓',
        '黄宝石胖头鱼',
        '霓虹胖头鱼',
        '彩虹小羊',
        '小飞机',
        '骷髅钥匙',
        '爆竹胖头鱼',
        '苍渊冰魄',
        '赤核熔心',
        '辉霆棱心',
        '烬穹晶髓',
        '虚界星核',
        "Conqueror's Peak",
        '74',
        '山 顶',
        '弹球炼狱',
        '烈冕号的太阳',
        '拥抱蜂后',
        'trans心',
        'maya我们喜欢你',
        '草莓树',
        '有内鬼！',
        'wow月莓',
        '船员玛德琳',
        '绿弹簧',
        'Celeste玩家交流群',
        '运动员玛德琳',
        'ninz炸弹',
        '酱四大厅',
        '封神雕塑',
        '正在思考的玛德琳',
    ],
    '3':[
        "chud小卒",
        "杨桃星球（星露谷版）",
        "征服者",
        "绿色巨型试管",
        "专业团队",
        '玛德琳农场的丰收',
        '蔚蓝山的圣诞树',
        '舔柠檬玛德琳',
        '扭曲的玛德琳',
        '纪念碑',
        '我是中国人，不是吗？',
        '水晶月莓',
        '水晶速通银草莓',
        '水晶银草莓',
        '腐烂草莓',
        '紫色月莓',
        '速启泡泡',
        '齿轮',
        '水晶钥匙',
        '骨堆',
        '吊灯',
        '小型陶罐',
        '中型陶罐',
        '大型陶罐',
        '燃烬守卫',
        '蛛影守卫',
        '地图碎片',
        '铁握守卫',
        '落地火炬',
        '绿色电脑',
        '蓝色电脑',
        '橙色电脑',
        '传闻录',
    ],
    '4':[
        "水晶金草莓",
        "水晶速通金草莓",
        "博丽灵梦",
        "芙兰朵露",
        "吉伊卡哇",
        "蕾米莉亚",
        "林克",
        "小骨",
        "射速模块",
        "导弹包",
        "遥控机器人",
        "脉冲雷达",
        "导弹模块",
        "corkr900",
        "水晶飞金草莓",
        "飞金草莓",
        "星光草莓",
        "巨型生化罐",
        "伪门",
        "损坏的生化罐",
        "Lambert博士",
        "地热发电机",
        "终端电脑（左）",
        "终端电脑（右）",
        '收容装置',
    ],
    '5':[
        "黑山猫",
        "勇士玛德琳",
        "Medamayaki Dyna",
        "水晶彩虹草莓",
        "玄霜",
        "创世纪",
        "中枢紫核",
        "坚果凌云",
        "彩虹月莓",
        "可怜卒",
        "UwU卒",
        "goose!",
        "PPNyan",
        "熔心珠",
        "xiaozu-notboom",
        '迷路女孩',
        'Zeus',
    ]
}

madeline_data4 = {
    '1':{
        '1':{
            'name': '很舒服的玛德琳',
            'description':
            '她很舒服，不要打扰她'
        },
        '2':{
            'name': '害怕玛德琳',
            'description':
            '缆车嘎吱嘎吱的晃荡，玛德琳害怕极了…… 快去请金羽毛！'
        },
        '3':{
            'name': '蒙眼玛德琳',
            'description':
            '玛德琳带上了眼罩，准备摸黑进行她的下一次爬山，可能她要爬的是9d？'
        },
        '4':{
            'name': '对话框',
            'description':
            '仅仅是一个对话框，仅此而已'
        },
        '5':{
            'name': '酱一',
            'description':
            '非常简单，散步图，没有任何花里胡哨的技巧'
        },
        '6':{
            'name': '酱二',
            'description':
            '增加一点小技巧，但仍在官图范围内，简单好玩，眩晕除外'
        },
        '7':{
            'name': '酱三',
            'description':
            '水温升高，挑战开始，难度中等，有挑战性，（另一座山？'
        },
        '8':{
            'name': '酱四',
            'description':
            '杨桃超新星！！！！ 好听的音乐，好玩的图！难度？先别管它了！'
        },
        '9':{
            'name': '酱五',
            'description':
            '你已经是一个成熟的蔚蓝外星人了！'
        },
        '10':{
            'name': '8旗动画',
            'description':
            '嗯 有7旗动画了，当然也要有8旗动画啊~'
        },
        '11':{
            'name': '象牙小船',
            'description':
            '继杂鱼之旅之后小船抵达了下一个观光点---- 象牙！'
        },
        '12':{
            'name': '草莓酱通关动画',
            'description':
            '过关啦! 果……果酱溢出来了！！！！'
        },
        '13':{
            'name': '小雨伞',
            'description':
            '雨落玫瑰的小雨伞，喜欢这张抓水母耗体力的变种图吗？'
        },
        '14':{
            'name': '荷塘月色',
            'description':
            '超级机关双重加速高速图，一顿操作猛如虎，啪啪啪啪啪啪啪（烟花声）'
        },
        '15':{
            'name': '千空之寺',
            'description':
            '优质散步图，音乐好听，风景好看，果冻好玩'
        },
        '16':{
            'name': '意念力',
            'description':
            '红伞伞，白杆杆……玛德琳吃了后冲的神志不清'
        },
        '17':{
            'name': 'LEVEL UP',
            'description':
            '升级了！ 你现在可以在空中冲刺两次了（为什么可以在空中冲刺？'
        },
        '18':{
            'name': '红宝石',
            'description':
            '玛德琳在爬山途中被风刮跑了！ 不过她发现了这块红宝石！（也是水晶之心的融合材料）'
        },
        '19':{
            'name': '黄玉',
            'description':
            '爬山途中在旅馆休息（雾）时看到的神秘黄色水晶，合成7a水晶之心的重要原材料'
        },
        '20':{
            'name': '珍珠',
            'description':
            '神庙的密藏，7a水晶之心高级融合材料（老值钱了'
        },
        '21':{
            'name': '星型宝石',
            'description':
            '玛德琳在山脚下捡到的宝石，五个角似乎在说还有五个宝石（？）'
        },
        '22':{
            'name': '紫宝石',
            'description':
            '蓝紫色的宝石，是玛德琳在废墟中发现的，真奇怪，废墟里怎么会有宝石？'
        },
        '23':{
            'name': '青宝石',
            'description':
            '玛德琳在横竖交错的果冻中发现了这个，不过可能时间太久了掉色了（'
        },
        '24':{
            'name': '粉云',
            'description':
            '一次性的云，把握住机会，要记得：失去就不再回来！'
        },
        '25':{
            'name': '钥匙',
            'description':
            '作用很简单的一把钥匙，帮你打开一扇锁上的门。但是为什么任意一把钥匙能打开任意一把锁呢？'
        },
        '26':{
            'name': '冰球',
            'description':
            '小心了！ 虽然它现在可以踩，但是它变成火球的时候是致命的！'
        },
        '27':{
            'name': '开门',
            'description':
            '你拿到了钥匙，打开了挡路的门！'
        },
        '28':{
            'name': '伤心坏德琳',
            'description':
            '坏德琳伤心了！'
        },
        '29':{
            'name': '苍渊冰芯',
            'description':
            '冰魄能量压缩后的核心形态，可镶嵌于武器上释放霜冻脉冲，低温蓝光如呼吸般明灭。'
        },
        '30':{
            'name': '赤核幼焰',
            'description':
            '熔心的初生形态，虽体积微小却能持续辐射热能，常被用作便携式能量炉核心。'
        },
        '31':{
            'name': '辉霆棱芯',
            'description':
            '棱心的能量收束体，可投射出雷电护盾，迷你化后更易与机械装置共鸣。'
        },
        '32':{
            'name': '烬穹晶砂',
            'description':
            '晶髓破碎后的微粒集合体，携带时会在地面拖曳出灼热光痕，可重组为临时护甲。'
        },
        '33':{
            'name': '虚界星屑',
            'description':
            '星核分裂出的不稳定碎片，虽无实体却能寄生在生物体内增幅精神力，危险且迷人。'
        },
        '34':{
            'name': '请选择你的拍屏导师',
            'description':
            '所以是不会截屏吗……'
        },
        '35':{
            'name': '现在是幻想时间',
            'description':
            '玛德琳在幻想自己拿了202草莓，要不要叫醒她呢……'
        },
        '36':{
            'name': 'summitstare',
            'description':
            '这个山怎么在盯着你……'
        },
        '37':{
            'name': '酱一心“门”',
            'description':
            '这个门还挺好看的'
        },
        '38':{
            'name': 'skate.ppt',
            'description':
            '蓝鸟居然还会滑板（'
        },
        '39':{
            'name': '油桶',
            'description':
            '玛德琳开船所需的燃料'
        },
        '40':{
            'name': '草莓酱纪念碑',
            'description':
            '上面有草莓酱的所有mapper'
        },
        '41':{
            'name': '我有抑郁症',
            'description':
            '好像玛德琳还真有……'
        },
        '42':{
            'name': '没人疼就去爬山吧',
            'description':
            '玛德琳是浑身疼，我们是手指疼'
        },
        '43':{
            'name': '全都是外星人！',
            'description':
            '被群u(外星人)环绕的玛德琳，看起来像是被下云了'
        },
        '44':{
            'name': '你的死亡次数',
            'description':
            '一人一个草莓就原谅了'
        },
        '45':{
            'name': '给我玩蔚蓝',
            'description':
            '对，说你呢'
        },
    },
    '2':{
        '1':{
            'name': '水晶草莓',
            'description':
            '晶莹剔透的魔法果实，外形如同水晶雕琢而成。'
        },
        '2':{
            'name': '水晶速通铜草莓',
            'description':
            '表面覆盖着古老的铜色纹路，仿佛承载着时间的重量。'
        },
        '3':{
            'name': '水晶飞草莓',
            'description':
            '外形与普通水晶草莓相似，两侧生长着由纯净魔力凝聚而成的羽翼。'
        },
        '4':{
            'name': 'Strawberry Jam',
            'description':
            '广受蔚蓝玩家喜爱的大型mod, 还等什么，快去玩！'
        },
        '5':{
            'name': '概率论与数理统计',
            'description':
            '玛德琳的统计学教科书（确信）'
        },
        '6':{
            'name': 'Sapphire Ruins',
            'description':
            '蓝宝石遗迹，一张小短图'
        },
        '7':{
            'name': '画游',
            'description':
            '在画界畅游吧，有很多奇妙机制的大型mod'
        },
        '8':{
            'name': '水莓',
            'description':
            '呀 这颗草莓汁水太饱满了，一碰就爆开来了 ! WET!'
        },
        '9':{
            'name': '紫色飞草莓',
            'description':
            '好奇怪的草莓，也许是翅膀和草莓有排异反应吧（确信'
        },
        '10':{
            'name': '速通爆炸',
            'description':
            '速通草莓：你跑的太墨迹了，这边死一下 那边多按一下的，就这还敢带着我？炸死你！'
        },
        '11':{
            'name': '核心草莓',
            'description':
            '烈焰之心，莓有极限！\n这是生长于核心的草莓，一个火力与果味兼具的神秘角色，头戴冰蓝王冠，脸庞燃烧着炽热能量。别被可爱的外表骗了，它可是战场上最甜美又最危险的存在——每一击都带着爆浆般的威力，专治各种不服！'
        },
        '12':{
            'name': '黄宝石胖头鱼',
            'description':
            '这只河豚闪耀着黄玉般的光辉，既有奢华的外表，又不失河豚的“爆脾气”！据说，捕捉到它的人会迎来好运，但前提是你得先避开它的致命一刺！'
        },
        '13':{
            'name': '霓虹胖头鱼',
            'description':
            '这是一只特别的粉红河豚，外表呆萌，但是和其他河豚一样暗藏杀机！一旦受到惊吓，它会迅速膨胀，形成天然防御。别被它的可爱迷惑，惹毛了它，分分钟给你来个“河豚弹击”！更恐怖的是，有时候他会藏在背景里面偷偷的给你一个惊喜！'
        },
        '14':{
            'name': '彩虹小羊',
            'description':
            '它不是普通的羊，它是一只踏着彩虹而来的小可爱！每走一步都洒下一片绚烂，传说跟随它的人会被幸福与好运包围，有极大概率在下一抓抓到藏品哦！但小心别被它的可爱闪到眼睛。 '
        },
        '15':{
            'name': '小飞机',
            'description':
            '看似可爱的外表下隐藏着大恐怖！喜欢它的手感吗？ 嗯?'
        },
        '16':{
            'name': '骷髅钥匙',
            'description':
            '看起来既神秘又危险，仿佛能开启某个被遗忘已久的禁忌之门！传说只有真正的勇者才能找到它，而它的作用不仅仅是开锁——也许还会释放出沉睡在深渊中的远古力量。你敢带着它继续前行吗？小心，门后那玩意可不是闹着玩的！'
        },
        '17':{
            'name': '爆竹胖头鱼',
            'description':
            '爆竹当然会爆炸啦，这可比河豚爆炸合理多了，就是玛德琳不会被炸死有点奇怪（？'
        },
        '18':{
            'name': '苍渊冰魄',
            'description':
            '深海冰川中淬炼的永冻结晶，表面流动着液态寒光，触碰时会在空中凝结出冰晶矩阵。'
        },
        '19':{
            'name': '赤核熔心',
            'description':
            '地脉岩浆凝成的灼热晶核，内部悬浮着永不熄灭的火焰星屑，高温使其周围空气扭曲。'
        },
        '20':{
            'name': '辉霆棱心',
            'description':
            '吸收雷暴能量的闪电晶簇，表面布满金色裂痕，激活时会引发电磁风暴。'
        },
        '21':{
            'name': '烬穹晶髓',
            'description':
            '火山灰与落日余晖交织形成的琥珀晶体，内部封存着古代文明的记忆残影。'
        },
        '22':{
            'name': '虚界星核',
            'description':
            '陨落星域中滋生的反物质水晶，表面漂浮着暗紫色星云漩涡，能扭曲空间结构。'
        },
        '23':{
            'name': "Conqueror's Peak",
            'description':
            '另一座山! 征服者山！ 去征服它吧！'
        },
        '24':{
            'name': '74',
            'description':
            '超级好玩无冲咖啡图，这旅店是一秒也呆不下去了'
        },
        '25':{
            'name': '山 顶',
            'description':
            '再爬一次这座山吧！ 但这次，难度会翻十倍！'
        },
        '26':{
            'name': '弹球炼狱',
            'description':
            '噩梦弹球图，抽奖抽奖继续抽奖，银练不了一点'
        },
        '27':{
            'name': '烈冕号的太阳',
            'description':
            '杨桃超新星的早期形态（'
        },
        '28':{
            'name': '拥抱蜂后',
            'description':
            '在蜂窝里安抚蜂后的madeline'
        },
        '29':{
            'name': 'trans心',
            'description':
            'trans rights!!!'
        },
        '30':{
            'name': 'maya我们喜欢你',
            'description':
            '这画风怎么那么熟悉……'
        },
        '31':{
            'name': '草莓树',
            'description':
            '2猎的草莓树就是这个（'
        },
        '32':{
            'name': '有内鬼！',
            'description':
            '蜂蜜工厂里面进入了一个内鬼，员工们正在寻找他……'
        },
        '33':{
            'name': 'wow月莓',
            'description':
            '这个才是正常的月莓，不是how('
        },
        '34':{
            'name': '船员玛德琳',
            'description':
            'red is sus'
        },
        '35':{
            'name': '绿弹簧',
            'description':
            '与暴风雪，白果冻和成语的绝佳搭配！'
        },
        '36':{
            'name': 'Celeste玩家交流群',
            'description':
            '什么时候Celeste伯特交流群群也能有2000人……'
        },
        '37':{
            'name': '运动员玛德琳',
            'description':
            '玛德琳平u好像可以达到>40km/h的速度（'
        },
        '38':{
            'name': 'ninz炸弹',
            'description':
            '红温的ninz，在一猎好像有正常版本……'
        },
        '39':{
            'name': '酱四大厅',
            'description':
            '本大厅含有这些要素……'
        },
        '40':{
            'name': '封神雕塑',
            'description':
            '看到这个的时候应该是要封神了吧'
        },
        '41':{
            'name': '正在思考的玛德琳',
            'description':
            '所以这面怎么过啊……'
        },
    },
    '3':{
        '1':{
            'name': 'chud小卒',
            'description':
            '蔚蓝已经沦陷，亿万人必须奥歘'
        },
        '2':{
            'name': '杨桃星球（星露谷版）',
            'description':
            '据说，住在这个星球的人们很喜欢种杨桃？'
        },
        '3':{
            'name': '征服者',
            'description':
            '独自在寒风中~ 冷风不断地吹过~'
        },
        '4':{
            'name': '绿色巨型试管',
            'description':
            '杨桃实验室也是实验室'
        },
        '5':{
            'name': '专业团队',
            'description':
            '这个团队可是抬走了数以万计的玛德琳啊……'
        },
        '6':{
            'name': '玛德琳农场的丰收',
            'description':
            '玛德琳爬完山后，成为了一个农场主，这是她种的东西……'
        },
        '7':{
            'name': '蔚蓝山的圣诞树',
            'description':
            '我们蔚批也要有自己的圣诞树'
        },
        '8':{
            'name': '舔柠檬玛德琳',
            'description':
            '她下一秒会是什么反应呢……'
        },
        '9':{
            'name': '扭曲的玛德琳',
            'description':
            '柠檬好酸啊！！！'
        },
        '10':{
            'name': '纪念碑',
            'description':
            '在洞穴的深处，一座古朴的纪念碑静静矗立着，刻满了曾在此留下足迹的冒险者的名字。'
        },
        '11':{
            'name': '我是中国人，不是吗？',
            'description':
            '这就是把reckoning放进cnhist的理由？（'
        },
        '12':{
            'name': '水晶月莓',
            'description':
            '月光的化身，表面覆盖着神秘的月纹，散发着幽蓝色的光芒。'
        },
        '13':{
            'name': '水晶速通银草莓',
            'description':
            '散发着银色的时间光辉，表面刻有复杂的时光符文。'
        },
        '14':{
            'name': '水晶银草莓',
            'description':
            '散发着柔和的银色光辉，宛如月光凝结而成的果实。'
        },
        '15':{
            'name': '腐烂草莓',
            'description':
            '这草莓真的能捡么？（要知道捡来的草莓都要做进派里的啊！！！！'
        },
        '16':{
            'name': '紫色月莓',
            'description':
            '玛德琳又到了一个奇怪的星球，在这里发现了一个奇怪的月莓'
        },
        '17':{
            'name': '速启泡泡',
            'description':
            '这个泡泡进入后会以极快的速度启动，省去了你手动泡泡速启的功夫！不过有时候也会导致手忙脚乱就是了……'
        },
        '18':{
            'name': '齿轮',
            'description':
            '危险！'
        },
        '19':{
            'name': '水晶钥匙',
            'description':
            '这是一把由纯净水晶雕琢而成的神秘钥匙，蕴藏着无尽的秘密与能量。'
        },
        '20':{
            'name': '骨堆',
            'description':
            '在陵墓的深处，一片森白的骨堆静静地堆积在角落，记录着无数逝去的生命。'
        },
        '21':{
            'name': '吊灯',
            'description':
            '在陵墓的穹顶之下，一盏盏吊灯如漂浮的星辰般悬挂着。'
        },
        '22':{
            'name': '小型陶罐',
            'description':
            '在圣域的壁龛中，小巧的陶罐静静陈列着，是一件精致的艺术品。'
        },
        '23':{
            'name': '中型陶罐',
            'description':
            '在圣域的祭坛旁，中等大小的陶罐安静地摆放着，仿佛一位虔诚的侍者。'
        },
        '24':{
            'name': '大型陶罐',
            'description':
            '在圣域的角落，体型较大的陶罐安稳地摆放着，仿佛一位沉默的守护者。'
        },
        '25':{
            'name': '燃烬守卫',
            'description':
            '在圣域的幽暗一隅，一尊坐姿的雕像守护着珍宝——炸弹。'
        },
        '26':{
            'name': '蛛影守卫',
            'description':
            '在绿辉石矿井的深处，一尊面容模糊的雕像守护着珍品——蜘蛛磁铁。'
        },
        '27':{
            'name': '地图碎片',
            'description':
            '在你的地图上显示当前区域的一部分。（我去，地下终端怎么这么大一片）'
        },
        '28':{
            'name': '铁握守卫',
            'description':
            '在庇护所废墟的深处，一尊体型较小的守护雕像守护着珍宝——强握手套。他的第二个化身则守护着另一个珍宝——双筒望远镜。'
        },
        '29':{
            'name': '落地火炬',
            'description':
            '在陵墓中，一座座落地火炬静静伫立，默默点亮着这片被时间遗忘的领域。'
        },
        '30':{
            'name': '绿色电脑',
            'description':
            '动能中心的电脑呈现出绿色的光芒，令人宁静而安心。'
        },
        '31':{
            'name': '蓝色电脑',
            'description':
            '推进中心和地热发电厂中的电脑散发着冷冽的气息，就像一个冰冷的决策者。'
        },
        '32':{
            'name': '橙色电脑',
            'description':
            '收容单元内的电脑颜色很醒目，使用它需要很高的权限。'
        },
        '33':{
            'name': '传闻录',
            'description':
            '记录着Madeline在斯莱斯特山之下发现的所有秘密。'
        },
    },  
    '4':{
        '1':{
            'name': '水晶金草莓',
            'description':
            '通体闪耀着金色的光辉，宛如一颗被阳光亲吻过的宝石。'
        },
        '2':{
            'name': '水晶速通金草莓',
            'description':
            '时间魔法的巅峰之作，通体闪耀着金色的时间之光，内部仿佛蕴含着无数时光的碎片。'
        },
        '3':{
            'name': '博丽灵梦',
            'description':
            '没有异变的日子真是休闲呢~'
        },
        '4':{
            'name': '芙兰朵露',
            'description':
            '呐~要陪我玩会游戏吗~'
        },
        '5':{
            'name': '吉伊卡哇',
            'description':
            '吉伊卡哇现在仍为除草5级而努力学习中。'
        },
        '6':{
            'name': '蕾米莉亚',
            'description':
            '蕾米莉亚·抱头蹲防·斯卡雷特'
        },
        '7':{
            'name': '林克',
            'description':
            '你才叫塞尔达，你全家都叫塞尔达！'
        },
        '8':{
            'name': '小骨',
            'description':
            '魔王城军队中最年轻的骷髅。\n因为他的身材很小，大家都叫他小骨。'
        },
        '9':{
            'name': '射速模块',
            'description':
            '射速模块能让机器人更快地连续发射光束，从而提升其攻击能力和响应能力。每个射速模块都会减少光束发射冷却的15%。'
        },
        '10':{
            'name': '导弹包',
            'description':
            '导弹包可用于升级机器人的导弹模块。其初始的最大容量为10枚导弹，每个导弹包都可增加2枚最大导弹量。'
        },
        '11':{
            'name': '遥控机器人',
            'description':
            'madeline可以将自己的意识转移到这个机器人之中，操纵其冲进狭窄的通道。机器人配有可在近距离发射光束的炮台。机器人还能抵御熔岩和高温，但易溶于酸和水。'
        },
        '12':{
            'name': '脉冲雷达',
            'description':
            '这款微型雷达可探测这个房间所隐藏起来的要素，帮助madeline轻松找到更多隐藏房间和通道。如果雷达探测到了它们，那么其将不断发出响声来提醒使用者，同时使隐藏要素暂时显现。'
        },
        '13':{
            'name': '导弹模块',
            'description':
            '此模块允许机器人的炮台去发射远程导弹。导弹可以在撞击后炸毁某些墙壁、炸飞某些障碍物、或激活红色开关。要发射导弹，机器人必须先有剩余的弹药，那可在触碰导弹填充时恢复。'
        },
        '14':{
            'name': 'corkr900',
            'description':
            'corkr900，医学界的逃跑冠军\n虽然他并没有手握治愈之术，但面对危险时，腿比治疗还快！这次的尝试显然不太顺利——别担心，失败只是成功的前奏，下次他一定能跑得更潇洒、更有风度！（也许吧……）'
        },
        '15':{
            'name': '水晶飞金草莓',
            'description':
            '水晶金草莓的升华形态，两侧的羽翼则由金色光晕编织而成。'
        },
        '16':{
            'name': '飞金草莓',
            'description':
            '带翅膀的金草莓，想要得到它，在爬上路上一次都不能冲！（这才对嘛，哪儿有人可以空中无动力突进的）'
        },
        '17':{
            'name': '星光草莓',
            'description':
            '星耀莓光，闪亮登场！\n这是星光草莓，一颗融合星辉与莓果能量的神秘存在，闪耀的金色星芒象征着无尽的力量与荣耀。别小看它可爱的笑容，每一次旋转都能掀起星尘风暴，把敌人打得眼冒星星！面对它，只有两种选择——要么被闪瞎，要么被打爆！'
        },
        '18':{
            'name': '巨型生化罐',
            'description':
            '这座安装于地下终端的巨型生化罐足有十米高，外壳由暗银色星核合金铸造。罐体内部充满幽蓝色培养液，其中悬浮着一具类人形生物躯体。'
        },
        '19':{
            'name': '伪门',
            'description':
            '近期抓马世界遭遇大量伪门入侵，此生物会将身体的一小部分隐藏成地狱传送门的模样欺骗新手猎人靠近后将其扎爆\n据说此生物来源于神秘的盖似世界，我们将持续为您提供相关报道'
        },
        '20':{
            'name': '损坏的生化罐',
            'description':
            '罐体中部被某种巨力从内部撕裂，锯齿状裂口边缘挂着腥臭的腐蚀性粘液，培养液混合着未知生物的黑色血液在地面形成沸腾的菌毯。'
        },
        '21':{
            'name': 'Lambert博士',
            'description':
            '打开地下终端的电脑，便能从她口中得知实验室的记录日志。'
        },
        '22':{
            'name': '地热发电机',
            'description':
            '当中枢紫核被取走，整个地下终端的能量必须依靠它……'
        },
        '23':{
            'name': '终端电脑（左）',
            'description':
            '中枢装置的左侧是一台宽屏电脑，实时监测中枢紫核的能量波动、装置的运行状态，以及周围环境的数据。'
        },
        '24':{
            'name': '终端电脑（右）',
            'description':
            '中枢装置的右侧是一台高屏电脑，不仅能展示宝石的三维模型，还能调控装置的运行参数。'
        },
        '25':{
            'name': '收容装置',
            'description':
            '在收容单元的中央，一座巨大的装置被建立于此，其中收容着中枢紫核，为整个地下终端提供着源源不断的能量。'
        },
    },
    '5':{
        '1':{
            'name': '黑山猫',
            'description':
            '古尔韦对自己人生的概述，全在这不到20Kb的图片里了。'
        },
        '2':{
            'name': '勇士玛德琳',
            'description':
            '在中世纪时间线中，玛德琳没有成为登山者，而是变成了一个骁勇善战的武士，这是她在田间拍的照片。'
        },
        '3':{
            'name': 'Medamayaki Dyna',
            'description':
            '咖啡学者的末路，POWER无限的白色猫猫……\n放松~先喝杯咖啡休息一下吧。'
        },
        '4':{
            'name': '水晶彩虹草莓',
            'description':
            '七色光芒交织而成的奇迹之果，表面不断变幻着彩虹般的色彩。'
        },
        '5':{
            'name': '玄霜',
            'description':
            '抬眸，前途茫茫无路。回头，身后遥遥无度。'
        },
        '6':{
            'name': '创世纪',
            'description':
            '这个生物从实验室的其中一个培养管中逃了出来。它可能在这里被研究了很长时间，似乎具有很强的攻击性。也极其敏捷且迅速，隐藏在黑暗之中以更好的接近猎物。'
        },
        '7':{
            'name': '中枢紫核',
            'description':
            '这枚紫色八边形晶体被收容于地下终端的核心防护舱中，它是整个系统的能源中枢。'
        },
        '8':{
            'name': '坚果凌云',
            'description':
            '顾名思义，云上的坚果\n沉迷抓马和抓kid，梦想是成为0猎大王，喜欢+1，会将成就挂在自己名字的后缀上\n曾经是抓马bet2大王，不过经历几次破产之后就金盆洗手了\n你受到了坚果的祝福，以后zhua的冷却将会减少0min。'
        },
        '9':{
            'name': '彩虹月莓',
            'description':
            '彩虹月莓，双倍神秘，七彩加倍！\n彩虹草莓与月莓的奇幻结合，既有彩虹的绚烂，又带着月光的神秘。这颗彩虹月莓据说只在星夜交汇时出现，蕴含着无法预测的力量，甜中带酷，凡是尝过的人都能感受到彩虹般的能量爆发！小心，一口下去，可能会开启未知的冒险之旅'
        },
        '10':{
            'name': '可怜卒',
            'description':
            '这牌/枪/擂台/陷阱/提取器/fhloy怎么演我[可怜]'
        },
        '11':{
            'name': 'UwU卒',
            'description':
            'UwU是一种在蔚p中流行的新型病毒'
        },
        '12':{
            'name': 'goose!',
            'description':
            '谁能想到Scraggy1是仙人掌与他的合体。'
        },
        '13':{
            'name': 'PPNyan',
            'description':
            '社区里的代表人物，Music Translation Contest 2的举办人。'
        },
        '14':{
            'name': '熔心珠',
            'description':
            '一颗蕴含远古秘能的珠子，放入特定装置即可操控熔岩的高度，仿佛让岩浆拥有了心跳。'
        },
        '15':{
            'name': 'xiaozu-notboom',
            'description':
            '小卒在.game3捞了不少草莓，不会动不动就boom了'
        },
        '16':{
            'name': 'Zeus',
            'description':
            '献祭了这辈子的运气，换来了超高校级的裸抓藏品能力，但是在ggl，提取器，急救包等运气博弈中损失惨重(太痛了)\n一饮一啄皆有定数啊……'
        },
        '17':{
            'name': '迷路女孩',
            'description':
            '你抓到了一个迷路的女孩，她看起来很疑惑，向你表达感谢后询问你是否认识她的兄长，去问问林筠吧，也许他认识这个孩子。'
        },
    }
}