__all__ = [
    'rabbit_madeline1',
    'madeline_name_list1',
    'madeline_data1'
]

#一号猎场兔类madeline集合
rabbit_madeline1 = [
    [3, 12],
    [3, 20],
    [4, 8],
    [4, 9],
    [4, 10],
    [5, 3]
]

#madeline名字集合表
madeline_name_list1 = {
    '1':
    [
        '草莓',
        '弹球玛德琳',
        '蛙德琳',
        'player(spawn point)',
        '首德琳',
        'Madeline in the box',
        '甩头玛德琳',
        '阐释你的玛德琳',
        'madeline',
        '弹球',
        'c',
        '按钮',
        'Chained Corner Boost',
        'Sunnyline？',
        'Oshiro',
        '旋转玛德琳',
        '奶奶',
        '可怜玛德琳',
        '裂图',
        'seeker',
        '蓝鸟',
        '大江传',
        '串串传',
        '久安传',
        '好活',
        '来自新浪的疑惑'
    ],
    '2':
    [
        '灰尘精灵',
        'HOW月莓',
        'wavedash.ppt',
        '弹球猫猫虫',
        '快逃玛德琳',
        '流口水玛德琳',
        'ninz',
        'UwU Kevin',
        'MC玛德琳',
        '玛德琳的妈妈',
        '沉思炼狱',
        '弹跳madeline',
        '可爱煤球',
        '正在跳舞的玛德琳',
        '月莓',
        '速通铜草莓',
        '草煤',
        '霓虹草莓',
        '受到惊吓',
        'just monika',
        '远离新型网络诈骗',
        '失去就不再回来',
        '灰尘精灵的微笑'
    ],
    '3':
    [
        'theo',
        'niko',
        '7旗动画',
        'Kevin玛德琳',
        '草莓原神',
        '玛德道琳',
        '地球之刃',
        'Very Madline',
        '小蓝人',
        '不要再奥歘了！',
        '正在忙着什么事情的玛德琳',
        '抱着Sunny的玛德琳',
        '银草莓',
        '速通银草莓',
        '金草莓飞机',
        '怂与妥协（上册）',
        '怂与妥协（下册）',
        '酒精',
        '失去梦想',
        '抱心玛德琳',
        "强握手套",
        '突进靴',
        '双筒望远镜',
    ],
    '4':
    [
        'ralsei',
        '卡比',
        '咖波',
        '芙莉莲',
        'evil',
        'neuro',
        'kid',
        '艾莉娜',
        '伊莉斯',
        '可可亚',
        '金草莓',
        'Alula',
        '速通金草莓',
        "大雕像",
        "能量罐",
        "炸弹",
    ],
    '5':
    [
        'Desom-fu',
        '野生小卒',
        '猫娘玛德琳',
        '铂金草莓',
        '弹球恋欲',
        '坠落谜题',
        '彩虹草莓',
        '余烬棱石',
        '圣律方石',
        '鸟人像',
    ]
}

#madeline档案信息
madeline_data1 = {
    '1':{
        '1':{
            'name': '草莓',
            'description': 
            '摘 不 到 那颗草莓？\n'
            '-事实：草莓很难摘\n'
            '-哇哦，草莓好高！\n'
            '-还要一堆特殊技巧\n'
            '-而 另一个你 不动手帮忙\n'
            '-（她最坏了）\n\n'
            '不可能完成的任务？？？'
        },
        '2':{
            'name': '弹球玛德琳',
            'description':
            '你说的对但是弹球炼狱是一款……'
        },
        '3':{
            'name': '蛙德琳',
            'description':
            '呱呱呱（玛德琳口音）'
        },
        '4':{
            'name': 'player(spawn point)',
            'description':
            '让玛德琳在此处生成'
        },
        '5':{
            'name': '首德琳',
            'description':
            '哼啊啊啊（玛德琳口音）'
        },
        '6':{
            'name': 'Madeline in the box',
            'description':
            '在箱子里的玛德琳'
        },
        '7':{
            'name': '甩头玛德琳',
            'description':
            '玛德琳开心地挥舞起了她粉色的头发。'
        },
        '8':{
            'name': '阐释你的玛德琳',
            'description':
            '来自《击败！篡夺者》的很文明的玛德琳，带着会飞行的韭菜盒子，可以很轻易的阐释你的梦'
        },
        '9':{
            'name': 'madeline',
            'description':
            '最简单的玛德琳。没什么好说的。'
        },
        '10':{
            'name': '弹球',
            'description':
            '叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮叮'
        },
        '11':{
            'name': 'c',
            'description':
            '©'
        },
        '12':{
            'name': '按钮',
            'description':
            '/续标识'
        },
        '13':{
            'name': 'Chained Corner Boost',
            'description':
            '蔚蓝笑传之ccb'
        },
        '14':{
            'name': 'Sunnyline？',
            'description':
            '这也是玛德琳，对，对吗'
        },
        '15':{
            'name': 'Oshiro',
            'description':
            '蔚蓝笑传之踩踩头'
        },
        '16':{
            'name': '旋转玛德琳',
            'description':
            '坏德琳带你螺旋升天'
        },
        '17':{
            'name': '奶奶',
            'description':
            'HAHAHAHAHAHAHAHA~~~~~'
        },
        '18':{
            'name': '可怜玛德琳',
            'description':
            'O_O'
        },
        '19':{
            'name': '裂图',
            'description':
            '喜欢我反重力疙瘩图吗？'
        },
        '20':{
            'name': 'seeker',
            'description':
            'seeker和新浪微博长得几乎一模一样，现在已经基本没有人知道它的本名了，都叫它新浪。'
        },
        '21':{
            'name': '蓝鸟',
            'description':
            '只是一只又会叫又会飞还难抓，并且 另一个你 不帮忙抓的一只鸟罢了（她最坏了）'
        },
        '22':{
            'name': '大江传',
            'description':
            '他改变了速通'
        },
        '23':{
            'name': '串串传',
            'description':
            '他改变了那个男人'
        },
        '24':{
            'name': '久安传',
            'description':
            '她改变了撅屁股'
        },
        '25':{
            'name': '好活',
            'description':
            '著名蔚蓝玩家azazz当年发的一句话，被套娃了'
        },
        '26':{
            'name': '来自新浪的疑惑',
            'description':
            '新浪看见你炼5b金时非得在那里奥欻，结果死了很多次，它非常疑惑'
        }
    },
    '2':{
        '1':{
            'name': '灰尘精灵',
            'description':
            '我相信你一定不会想在打图的时候遇到一堆灰尘精灵的，对吧。'
        },
        '2':{
            'name': 'HOW月莓',
            'description':
            '奇怪的月莓，被吃掉会发出HOW的声音'
        },
        '3':{
            'name': 'wavedash.ppt',
            'description':
            '凌波微步，快乐的舞步！'
        },
        '4':{
            'name': '弹球猫猫虫',
            'description':
            '似乎是猫猫虫上长了个弹球，让人忍不住想凑上去揉揉脸。' 
        },
        '5':{
            'name': '快逃玛德琳',
            'description':
            '玛德琳提醒您：前方有multiball'
        },
        '6':{
            'name': '流口水玛德琳',
            'description':
            '阿巴阿巴阿巴阿巴阿巴阿巴阿巴阿巴阿巴阿巴'
        },
        '7':{
            'name': 'ninz',
            'description':
            '站在你面前的是蔚蓝第一炼金大神ninz，你敢和他对视超过五秒吗'
        },
        '8':{
            'name': 'UwU Kevin',
            'description':
            '可爱的Kevin，比其他的Kevin更为温顺（虽然声音还是不好听）'
        },
        '9':{
            'name': 'MC玛德琳',
            'description':
            '玛德琳穿越到了mc里面，这是她的样子'
        },
        '10':{
            'name': '玛德琳的妈妈',
            'description':
            '小草莓们好呀，我是草莓妈妈'
        },
        '11':{
            'name': '沉思炼狱',
            'description':
            '孩子们我是6C'
        },
        '12':{
            'name': '弹跳madeline',
            'description':
            'Madeline从山顶上摘下来的这颗草莓意外的非常有弹性，于是她把这颗草莓当做了弹跳杆使用'
            },
        '13':{
            'name': '可爱煤球',
            'description':
            '煤球可爱捏~'
        },
        '14':{
            'name': '正在跳舞的玛德琳',
            'description':
            '玛德琳通过了白象后的胜利结算动画'
        },
        '15':{
            'name': '月莓',
            'description':
            'WOW！'
        },
        '16':{
            'name': '速通铜草莓',
            'description':
            '在吃心面前因为时间到了爆炸了，下次还敢炼双金吗？'
        },
        '17':{
            'name': '草煤',
            'description':
            '你确定真的要吃这颗草煤吗？'
        },
        '18':{
            'name': '霓虹草莓',
            'description':
            '吃了后会变得闪闪发光吗？'
        },
        '19':{
            'name': '受到惊吓',
            'description':
            '著名蔚蓝大神陈校长国内首翻金限，因为一只超级弹的胖头鱼'
        },
        '20':{
            'name': 'just monika',
            'description':
            'monika刚改名的时候，带来了这个重量级，吓坏了一圈人'
        },
        '21':{
            'name': '远离新型网络诈骗',
            'description':
            '著名蔚蓝202大神天府最喜欢用的一张表情包（群萌新不敢吭声），所以制作了这个表情包来反制（'
        },
        '22':{
            'name': '失去就不再回来',
            'description':
            '第一张失去就不再回来的梗图（'
        },
        '23':{
            'name': '灰尘精灵的微笑',
            'description':
            ':)'
        }
    },
    '3':{
        '1':{
            'name': 'theo',
            'description':
            '此时正在玩手机的theo一定想不到之后他会变成一块水晶……'  
        },
        '2':{
            'name': 'niko',
            'description':
            '一只成天抱着灯泡，爱吃薄煎饼的…猫？薄煎饼很美味，但是灯泡不知道去哪了。'  
        },
        '3':{
            'name': '7旗动画',
            'description':
            '不是你这动画怎么加载不出来啊？'  
        },
        '4':{
            'name': 'Kevin玛德琳',
            'description':
            '这只玛德琳似乎很头大（物理）。'    
        },
        '5':{
            'name': '草莓原神',
            'description':
            '你说的对，但《蔚蓝》是一款由EXOK Games Inc.制作并发行的一款像素风格的动作冒险类游戏，玩家将进入一个神秘的幻想地区——塞斯来特山。在这个世界中，玩家将扮演一位神秘的小女孩，拥有冲刺的力量，探索各个地区，结识各种性格各异、能力独特的伙伴，并与他们一起面对强大的水晶之心，寻找失散的草莓，同时揭开塞斯来特山的真相。'    
        },
        '6':{
            'name': '玛德道琳',
            'description':
            '大家好啊，我是玛德道琳~~~，今天来点大家想看的东西啊'    
        },
        '7':{
            'name': '地球之刃',
            'description':
            '点击输入文字'    
        },
        '8':{
            'name': 'Very Madline',
            'description':
            '众所周知，Badeline = 坏德琳，所以Madeline = Mad eline = 怒德琳'   
        },
        '9':{
            'name': '小蓝人',
            'description':
            '一具会拉屎的尸体。'
        },
        '10':{
            'name': '不要再奥歘了！',
            'description':
            '不要再Ultra了！Ultra是加拿大人研发的新型鸦片！加拿大人往你的电脑里安装大炮，当你Ultra时大炮就会被引燃！加拿大研发的机器人会自动生成Ultra图，不费任何人力就能让你的孩子上瘾！你的孩子已经失去了炼金能力！坚决抵制Ultra图！如果你认同我的看法，请转发出去，不要再Ultra了！抵制Ultra！！！'
        },
        '11':{
            'name': '正在忙着什么事情的玛德琳',
            'description':
            '玛德琳…等等……'
        },
        '12':{
            'name': '抱着Sunny的玛德琳',
            'description':
            '可爱捏'
        },
        '13':{
            'name': '银草莓',
            'description':
            '一命通关小图！'   
        },
        '14':{
            'name': '速通银草莓',
            'description':
            '不上不下，卡在那了，很想在快一点变成速通金吧！'   
        },
        '15':{
            'name': '金草莓飞机',
            'description':
            '呼呼呼~'
        },
        '16':{
            'name': '怂与妥协（上册）',
            'description':
            '本书为塞莱斯特官方教材的上册，案例是炼3ag时如何躲避到处乱动的煤球'
        },
        '17':{
            'name': '怂与妥协（下册）',
            'description':
            '本书为塞莱斯特官方教材的下册，案例是如何把自己隐藏起来'
        },
        '18':{
            'name': '酒精',
            'description':
            '我们在一位蔚蓝玩家的墓里发现了这张照片'
        },
        '19':{
            'name': '失去梦想',
            'description':
            '你不应该爬这座山！'   
        },
        '20':{
            'name': '抱心玛德琳',
            'description':
            '可爱捏*2'
        },
        '21':{
            'name': '强握手套',
            'description':
            '这幅手套能让madeline足以抓住大多数墙壁，并从墙上跳到另一边墙上。抓在墙上会缓慢消耗madeline的体力，直到其没有体力并滑落，此时则需要落地或触碰充能水晶以恢复体力。'
        },
        '22':{
            'name': '突进靴',
            'description':
            '这双靴子能让madeline在短距离内极速突进。在此过程中，其可以摧毁某些墙壁或激活某些机关。使用此能力后，需落地或触碰充能水晶才能再次使用。'
        },
        '23':{
            'name': '双筒望远镜',
            'description':
            '借助望远镜，madeline可以看到自身所在的整个房间，以便提前规划好前进路线。使用望远镜时无法移动，在不安全的地方也不能使用望远镜。'
        },
    },
    '4':{
        '1':{
            'name': 'ralsei',
            'description':
            '欢迎，我是这个王国的王子…这里是黑暗王国。'        
        },
        '2':{
            'name': '卡比',
            'description':
            '粉色的球体，有着小短手和红色的小脚。蓝色眼睛，视力不错，有脸颊。身高20cm，但在游戏里至少有半个人这么高。富有弹性。'  
        },
        '3':{
            'name': '咖波',
            'description':
            '你不龙，我不龙，大家都发猫猫虫~'  
        },
        '4':{
            'name': '芙莉莲',
            'description':
            '诶又有个宝箱，不行，就算是宝箱怪我也要去看看……哇啊！好黑好可怕！快放我出去！'  
        },
        '5':{
            'name': 'evil',
            'description':
            "欧美不紧不慢不快不慢的做🚫，最新视频网址🚫🚫🚫.🚫🚫欧美不紧不慢不快不慢的做🚫&`;欧~'~口`,槃`}`音`'内含欧美不紧不慢不快不慢的做🚫按钮随便你用&'~自动~`'~不口不紧不慢`,有很多功能: 与~按键~同步夏九九@Column!!! 完成!!! 久久!!! 完成!!! @<lvq-148971>"
        },
        '6':{
            'name': 'neuro',
            'description':
            '爱钱的龟🐢，好涩的狐🦊，白色的牛⚪，黑色的牛⚫，神经的蜂🐝，神经的蜂🐝，神经的蜂🐝，神经的蜂🐝，神经的蜂🐝\n还等什么？赶快加入神经大人伟大的蜂群吧！\nheart❤'
        },
        '7':{
            'name': 'kid',
            'description': 
            'kid，最普通的kid，本家的kid，游走于蓝天白云间的kid，活了数十年的kid，即使相比于其他的kid变种他普通的不能再普通，也依然被iwer们铭记于心，因为他是kid家族的祖先'
        },
        '8':{
            'name': '艾莉娜',
            'description':
            '艾莉娜是一只神秘变成人类的兔子。她对一切都很好奇，不容易激动，只是有点迟钝。喜欢在人们的名字前面加上“女士”和“先生”。她看起来很有礼貌，但很容易不小心冒犯别人。'  
        },
        '9':{
            'name': '伊莉斯',
            'description':
            '嘿嘿……艾莉娜……' 
        },
        '10':{
            'name': '可可亚',
            'description':
            '再给一根胡萝卜吧，就再给一根！' 
        },
        '11':{
            'name': '金草莓',
            'description':
            '百香果万神殿无伤从来都不被认为是可能的，那颗金草莓被放在那里只是作为一个诡计。Maya制作的部分就是用来看门的，防守着任何一颗来到7旗的金草莓，7旗使得熟练性成为了一个谎言，即使你侥幸通过了那个令人绝望的房间，你肯定也会死在Theo攀爬技巧的考验中。所有人都会屈服于那知道百香果万神殿的金草莓永远不会被摘得的绝望。' 
        },
        '12':{
            'name': 'Alula',
            'description': 
            '拟人化小蓝鸟（确信）'
        },
        '13':{
            'name': '速通金草莓',
            'description':
            '每一个madeline在春游的时候总是喜欢炼银的时候顺便把速通金带上，结果就是越跑越急越炼不出来' 
        },
        '14':{
            'name': '大雕像',
            'description': 
            '在幽深的洞穴深处，一尊巨大的雕像巍然矗立，自远古时代便已在此守护着一件珍宝——突进靴。'
        },
        '15':{
            'name': '能量罐',
            'description': 
            '体力支撑着madeline去使用各种能力。体力初始上限为75点，每个能量罐都会增加5点体力上限。' 
        },
        '16':{
            'name': '炸弹',
            'description': 
            'madeline可以用炸弹去炸开某些墙壁，也可与某些机关互动。一旦投掷，炸弹就将在短时间内爆炸。手持炸弹之时将无法使用突进以及其他需要空出手的能力。'
        },
    },
    '5':{
        '1':{
            'name': 'Desom-fu',
            'description':
            '这只狐娘由于太喜欢Celeste了，在一次奥欻的过程中一不小心把自己给奥进去了，导致自己也变成了蔚蓝的画风。不过她似乎有点粗心，总是一不小心就造成爆炸。'
        },
        '2':{
            'name': '野生小卒',
            'description':
            '野生小卒本来是一位 i wanna up主，但是在蔚蓝7.6超级打折后便成为了外星人蔚蓝玩家。她在每次去地下猎场的时候，每次出来都遍体鳞伤，被掉坑和debuff气晕。'
        },
        '3':{
            'name': '猫娘玛德琳',
            'description':
            '喵~'
        }, 
        '4':{
            'name': '铂金草莓',
            'description':
            'tx金，人类的终点\n会赢吗？'
        }, 
        '5':{
            'name': '弹球恋欲',
            'description':
            '弹球炼狱的娘化。难道只能被她玩弄于鼓掌之中吗？'
        }, 
        '6':{
            'name': '坠落谜题',
            'description':
            '来钻她的小缝吧！'
        }, 
        '7':{
            'name': '彩虹草莓',
            'description':
            'PERFECT！'
        },
        '8':{
            'name': '余烬棱石',
            'description':
            '这座曾被遗忘的庇护所废墟中，坍塌的廊柱与碎裂的符文间，悄然嵌着一枚流淌熔岩光泽的橙红晶体。'
        },
        '9':{
            'name': '圣律方石',
            'description':
            '这枚黄金般炽烈的方正晶体悬浮于圣所的祭坛之上，棱角如刀裁般精准，仿佛由神明亲手劈凿的法则碎片。'
        },
        '10':{
            'name': '鸟人像',
            'description':
            '这座雕像类似于斯莱斯特山下的其他雕像，但实际上是一种旨在保护珍贵的宝藏不被入侵者侵害的守卫机器。虽然它的外表看起来是金属制的，但其躯干内也包含着有机部分。'
        },
    }
}