__all__ = [
    'rabbit_madeline5',
    'madeline_name_list5',
    'madeline_data5'
]

rabbit_madeline5 = [
    [5, 1],
    [5, 7],
    [5, 11],
    [5, 19],
    [4, 6],
    [4, 8],
    [4, 11],
    [4, 14],
    [4, 15],
    [4, 18],
    [3, 6],
    [3, 19],
    [3, 29],
    [3, 33],
]

madeline_name_list5 = {
    '1':[
        "崩碎之歌",
        "玫瑰花园",
        "火刺",
        "冰刺",
        "小车",
        "Theo的水晶台",
        "缆车",
        "林间小径",
        "私人车道",
        "苍蓝洞穴",
        "管道与开关",
        "超光速",
        "（）（）（）（）（）",
        "蜂之怒",
        "暮光之城",
        "Java's Crypt",
        "化方为圆",
        "EAT GIRL",
        "眩晕",
        "对流层",
        "眼见为实",
        "潜在的一切",
        "飘渺飞升",
        "北极星",
        "来自星星的礼物",
        "草莓果园",
        "崩坏天际线",
        "香皂",
        "城市之上",
        "挤压",
        "午夜季风",
        "汤之海",
        "河豚运输公司",
        "不知所谓的机器",
        "塔",
        "开关理论",
        "漂泊深渊",
        "世界大穴",
        "破空之虹",
        "熔岩层",
        "反转山脊",
        "钟塔",
        "水之冲击",
        "死亡激光实验室",
        "节奏山脊",
        "圈圈环礁岛",
        "午夜之巅",
        "画境",
        "被核心的城市",
        "树巢",
    ],
    '2':[
        "小型终端电脑",
        "小电脑",
        "星空之眠",
        "霜冻碎片",
        "碧蓝",
        "净化行动",
        "深海迷航",
        "第五维度",
        "低重力植物园",
        "工地难题",
        "红蜜灯",
        "时之沙",
        "水母圣所",
        "史莱姆时间",
        "上层建筑",
        "星空遗迹",
        "炽热海沟",
        "金色黎明",
        "丛林快跑",
        "迷失森林",
        "密林之下",
        "克隆之击",
        "雨落玫瑰",
        "野兽之腹",
        "象牙",
        "猩空之穴",
        "kevintechspam.bin",
        "突触",
        "传送门难题",
        "星光站",
        "实验室",
        "虚空的召唤",
        "变向",
        "飞翔的电池",
        "天际篡夺者",
        "斑斓色彩",
        "空洞狭缝",
        "库塔拉花园",
        "风暴行者",
        "地铁霓虹",
        "浮点",
        "真_玛德琳：泡泡",
        "逆旅",
        "纽带",
        "时间谜题",
    ],
    '3':[
        "给我玩蔚蓝",
        "被捆起来的“左特？”",
        "喷泉",
        "Maya大街",
        "宇宙之眼",
        "在ultra的玛德琳猫猫",
        "非常热心的弹球",
        "弹球降临",
        "麦当劳",
        "0721大神",
        "安全提醒",
        "Celeste 伯特交流群",
        "猪奥歘",
        "电池",
        "累死了鸟",
        "被捆绑的鸟",
        "电所有人前列腺",
        "一顶帽子",
        "猫眼",
        "玛德升",
        "烹调玛德琳",
        "黏水母",
        "黑洞",
        "Coaster Madeline",
        "ReaLhecK3r",
        "他紫砂了",
        "资料柜",
        "服霸kele",
        "彩虹鮟鱇鱼",
        "铺满的棋盘",
        "抓墙提示牌",
        "跳跃提示牌",
        "贴吧玛德琳",
        "小雕像",
        "损坏的雕像",
        "高型陶罐",
        "奸笑玛德琳",
    ],
    '4':[
        "攀岩套装",
        "踏空徽章",
        "飞花金草莓",
        "寒冰草莓",
        "Wingmould",
        "乌鸦公主",
        "绫里真宵",
        "Mario",
        "神庙雕像",
        "守卫雕像",
        "库塔拉小兔子",
        "工地管理员",
        "风暴行者玛德琳",
        "浮点小猫",
        "浮点小狗",
        "小雪人",
        "Frisk",
        "坏鸟苏醒",
        "笑脸砖",
        "害羞幽灵",
        "电梯",
        "管道入口",
        "小水晶",
        "水晶碎片",
        "沙堆",
        "藤蔓",
    ],
    '5':[
        "影怪",
        "秘海之瞳",
        "远古灵珠",
        "幻想时间卒",
        "加载卒",
        "PirateZucchini",
        "cheems",
        "TGWK",
        "Art Nightmare",
        "火焰头",
        "库塔拉小狐狸",
        "钓鱼大师Zeus",
        "Smots Gaming",
        "Fangame Summer Feast",
        "红温Zeus",
        "pbot",
        "Zeus_boom",
        "金玛丽",
        "kidhole",
        "Lili",
        "奥歘鸡",
    ],
}


madeline_data5 = {
    '1':{
        '1':{
            'name': '崩碎之歌',
            'description':
            '喜欢节奏块么，那就多来点！在交错错错错错错节拍迷惘吧！'
        },
        '2':{
            'name': '玫瑰花园',
            'description':
            '超有趣的机制，可惜后面变成了天际篡夺者这个阴间玩意'
        },
        '3':{
            'name': '火刺',
            'description':
            '生长于热带，多数存在于核心部分，红色的刺带来的超高温可以瞬间将玛德琳气化'
        },
        '4':{
            'name': '冰刺',
            'description':
            '冰刺，刺如其名，生长在极寒地带，比如低温，高度危险！请勿接触！'
        },
        '5':{
            'name': '小车',
            'description':
            '嘀！嘀！嘀！'
        },
        '6':{
            'name': 'Theo的水晶台',
            'description':
            '嗯，没错，这儿挺舒服的，theo这么说，他还挺怀念在水晶里的日子（'
        },
        '7':{
            'name': '缆车',
            'description':
            '从黄金小山通往神秘寺庙的小缆车，吱呀吱呀真好玩'
        },
        '8':{
            'name': '林间小径',
            'description':
            '轻轻松松散步图，土遁真好玩'
        },
        '9':{
            'name': '私人车道',
            'description':
            '带着银草莓来到倒一，来到心下面，欻欻欻，（草莓尖叫声~'
        },
        '10':{
            'name': '苍蓝洞穴',
            'description':
            '神秘的机关，居然要冲刺撞击才能启动？'
        },
        '11':{
            'name': '管道与开关',
            'description':
            '果冻跳特训关，畅享飞的感觉'
        },
        '12':{
            'name': '超光速',
            'description':
            '这整张图除了倒一据说都是超冲教学？'
        },
        '13':{
            'name': '（）（）（）（）（）',
            'description':
            '酱五不得不品的一环'
        },
        '14':{
            'name': '蜂之怒',
            'description':
            '无限体力爽图，反泡泡嘎嘎冲'
        },
        '15':{
            'name': '暮光之城',
            'description':
            '超爽果冻机关图，双重加速，欻欻欻'
        },
        '16':{
            'name': "Java's Crypt",
            'description':
            '此地禁止随地大小变！'
        },
        '17':{
            'name': '化方为圆',
            'description':
            '泡泡往哪儿冲都给你标好了，你总不能还不知道该怎么打吧（'
        },
        '18':{
            'name': 'EAT GIRL',
            'description':
            'tmd坏德琳还在追我'
        },
        '19':{
            'name': '眩晕',
            'description':
            '说话！你颠来倒去还随意tp的想干什么？ '
        },
        '20':{
            'name': '对流层',
            'description':
            '飞咯~'
        },
        '21':{
            'name': '眼见为实',
            'description':
            '关灯图，但是可以自己开灯'
        },
        '22':{
            'name': '潜在的一切',
            'description':
            'VVVVVV'
        },
        '23':{
            'name': '飘渺飞升',
            'description':
            '好玩的向上飞的水母（pb:对，对么？）'
        },
        '24':{
            'name': '北极星',
            'description':
            '唏，可以和解么？'
        },
        '25':{
            'name': '来自星星的礼物',
            'description':
            '时间暂停解谜图，有点意思但是费脑子'
        },
        '26':{
            'name': '草莓果园',
            'description':
            '抛接图，运果酱，为后面运菠萝打下基础'
        },
        '27':{
            'name': '崩坏天际线',
            'description':
            'swap slut~  欸？还有剧情？'
        },
        '28':{
            'name': '香皂',
            'description':
            '奇怪的泡泡，怎么不给我刷新冲刺次数啊！！！'
        },
        '29':{
            'name': '城市之上',
            'description':
            '无冲图，但是我会中性跳'
        },
        '30':{
            'name': '挤压',
            'description':
            '贴心的给你对准了所有的缝，大胆的钻吧！'
        },
        '31':{
            'name': '午夜季风',
            'description':
            '后半段的音乐真好听啊（什么 难度，谁打图管难度？'
        },
        '32':{
            'name': '汤之海',
            'description':
            '这个泡泡怎么还不启动，急死我了，赶紧快启！'
        },
        '33':{
            'name': '河豚运输公司',
            'description':
            '怎么拿这个草莓还不让撞河豚啊！！！'
        },
        '34':{
            'name': '不知所谓的机器',
            'description':
            '路线解谜图，还得记冲刺顺序，好玩'
        },
        '35':{
            'name': '塔',
            'description':
            '塔 要 发 布 了'
        },
        '36':{
            'name': '开关理论',
            'description':
            '这图太好猜了，只有黑白的一眼就看出来了'
        },
        '37':{
            'name': '漂泊深渊',
            'description':
            '这图怎么这么长？'
        },
        '38':{
            'name': '世界大穴',
            'description':
            '空荡荡的图，错过一个开关硬币就过不去咯（真的吗?'
        },
        '39':{
            'name': '破空之虹',
            'description':
            '不要再奥欻了！'
        },
        '40':{
            'name': '熔岩层',
            'description':
            '捡个草莓还吓我一跳，真是的，搞什么啊'
        },
        '41':{
            'name': '反转山脊',
            'description':
            '咖啡山咖啡跳，有些还无对准……'
        },
        '42':{
            'name': '钟塔',
            'description':
            '这何尝不是一种时限塔'
        },
        '43':{
            'name': '水之冲击',
            'description':
            '啊？酱四？这张图？'
        },
        '44':{
            'name': '死亡激光实验室',
            'description':
            '这也太短了，甚至还没意识到结束了就结束了'
        },
        '45':{
            'name': '节奏山脊',
            'description':
            '来和我一起摇摆~'
        },
        '46':{
            'name': '圈圈环礁岛',
            'description':
            '弹弹的圈圈，比弹球那个玩意好玩多了'
        },
        '47':{
            'name': '午夜之巅',
            'description':
            '是玛德琳就来爬塔吧！'
        },
        '48':{
            'name': '画境',
            'description':
            '酱一神图！'
        },
        '49':{
            'name': '被核心的城市',
            'description':
            '给我干哪儿来了？这还是1a吗？'
        },
        '50':{
            'name': '树巢',
            'description':
            '果冻往返跑口牙！'
        },
    },
    '2':{
        '1':{
            'name': '小型终端电脑',
            'description':
            '你这电脑怎么这么扁？'
        },
        '2':{
            'name': '小电脑',
            'description':
            '深入数字世界，找寻潜在的一切，完成你的任务！'
        },
        '3':{
            'name': '星空之眠',
            'description':
            '一张小型9a五门图~'
        },
        '4':{
            'name': '霜冻碎片',
            'description':
            '走不通的路就用冲刺撞出来吧！'
        },
        '5':{
            'name': '碧蓝',
            'description':
            '乌漆嘛黑的嘛玩意！还要高速抛接？！'
        },
        '6':{
            'name': '净化行动',
            'description':
            '666，这警卫盐都不盐的，露头就秒！'
        },
        '7':{
            'name': '深海迷航',
            'description':
            '喜欢我给你准备在酱二图里的酱四面么'
        },
        '8':{
            'name': '第五维度',
            'description':
            '各类蹭墙跳专项训练，但都是对准的'
        },
        '9':{
            'name': '低重力植物园',
            'description':
            '跳一下飞老高了'
        },
        '10':{
            'name': '工地难题',
            'description':
            '玛德琳又被拉去打黑工了！'
        },
        '11':{
            'name': '红蜜灯',
            'description':
            '这个杆杆和这个把手好奇怪啊？'
        },
        '12':{
            'name': '时之沙',
            'description':
            '砸！瓦鲁多！'
        },
        '13':{
            'name': '水母圣所',
            'description':
            '这个水母能踩欸？'
        },
        '14':{
            'name': '史莱姆时间',
            'description':
            '速度速度速度！！！'
        },
        '15':{
            'name': '上层建筑',
            'description':
            '更加黑心的活来了！玛德琳举着重物在到处是滑不溜秋的墙上和地板上反复横跳……'
        },
        '16':{
            'name': '星空遗迹',
            'description':
            '怎么有一个地方搓奥歘比正路还简单呢？'
        },
        '17':{
            'name': '炽热海沟',
            'description':
            'tmd坏德琳还在追我！'
        },
        '18':{
            'name': '金色黎明',
            'description':
            '金限的背景，总感觉有点不妙的事情呢'
        },
        '19':{
            'name': '丛林快跑',
            'description':
            '兔子兔子兔子跳，不好！刹不住滑板了！！！'
        },
        '20':{
            'name': '迷失森林',
            'description':
            '迷路了，钥匙到底在哪儿啊？ 这里又要怎么上去啊？'
        },
        '21':{
            'name': '密林之下',
            'description':
            '掌控体力的时候来了！中性跳初见端倪！'
        },
        '22':{
            'name': '克隆之击',
            'description':
            '坏事了，坏德琳长刺了，不让我抱了呜呜呜呜呜'
        },
        '23':{
            'name': "雨落玫瑰",
            'description':
            '下雨了，但是我有小雨伞，不过我怎么没法中性跳了？'
        },
        '24':{
            'name': '野兽之腹',
            'description':
            '什么脏活累活都要玛德琳做，这次玛德琳被分配到巨兽肚子里面运炮弹了！'
        },
        '25':{
            'name': '象牙',
            'description':
            '高速图，可惜全是鸡'
        },
        '26':{
            'name': '猩空之穴',
            'description':
            '简单好玩的微操图'
        },
        '27':{
            'name': 'kevintechspam.bin',
            'description':
            '超级kevin图，在kevin身上奥欻吧!'
        },
        '28':{
            'name': '突触',
            'description':
            '精神崩坏的madeline在寻求治疗'
        },
        '29':{
            'name': '传送门难题',
            'description':
            '我在哪儿？我是谁？我在干什么？眼睛花了呜呜呜呜呜'
        },
        '30':{
            'name': '星光站',
            'description':
            '静悄悄的~'
        },
        '31':{
            'name': '实验室',
            'description':
            '水滴的最爱~'
        },
        '32':{
            'name': '虚空的召唤',
            'description':
            '喜欢我正走酱3倒走酱6fcg难度t0吗？'
        },
        '33':{
            'name': '变向',
            'description':
            '超大图，还好有方向指示'
        },
        '34':{
            'name': '飞翔的电池',
            'description':
            '要搬运的东西怎么五花八门的！！！'
        },
        '35':{
            'name': '天际篡夺者',
            'description':
            '小飞机好玩么？嗯？'
        },
        '36':{
            'name': '斑斓色彩',
            'description':
            '纯色图，嗯是色图不是色图'
        },
        '37':{
            'name': '空洞狭缝',
            'description':
            '对准图，喜欢f6么？'
        },
        '38':{
            'name': '库塔拉花园',
            'description':
            '在充满弹球花朵的花园里面飞来飞去，对了，喜欢库塔啦的草莓面么？'
        },
        '39':{
            'name': '风暴行者',
            'description':
            '雷电关，太压抑了好可怕~'
        },
        '40':{
            'name': '地铁霓虹',
            'description':
            '光污染啊！！'
        },
        '41':{
            'name': '浮点',
            'description':
            'tmd酱四怎么还有反重力！'
        },
        '42':{
            'name': '真_玛德琳：泡泡',
            'description':
            'theo又被不明物体困住了！！！'
        },
        '43':{
            'name': '逆旅',
            'description':
            '蔚蓝也要有自己的快乐老家和罐子人'
        },
        '44':{
            'name': '纽带',
            'description':
            '幻视绣湖了……'
        },
        '45':{
            'name': '时间谜题',
            'description':
            '解谜图，但是对操作要求更高了'
        },
    },
    '3':{
        '1':{
            'name': '给我玩蔚蓝',
            'description':
            '对，说你呢'
        },
        '2':{
            'name': '被捆起来的“左特？”',
            'description':
            '像极了左特在深巢里的样子'
        },
        '3':{
            'name': '喷泉',
            'description':
            '所以水去哪了（'
        },
        '4':{
            'name': 'Maya大街',
            'description':
            '一条非常普通的大街，充满了弹球和月亮块，稍有不慎就会被弹飞起来…等等，它的名字是()()ya大街吗？'
        },
        '5':{
            'name': '宇宙之眼',
            'description':
            '它的信号甚至比宇宙本身还要古老！'
        },
        '6':{
            'name': '在ultra的玛德琳猫猫',
            'description':
            '什么 U过来了！'
        },
        '7':{
            'name': '非常热心的弹球',
            'description':
            '就算技术不太好，只要开开心心弹就好啦！'
        },
        '8':{
            'name': '弹球降临',
            'description':
            '弹球来了！快来叮叮叮叮吧！'
        },
        '9':{
            'name': '麦当劳',
            'description':
            '麦当劳(mdl)也是玛德琳，兑'
        },
        '10':{
            'name': '0721大神',
            'description':
            '一开始叠了2层0721时，还没人意识到最后的结果...'
        },
        '11':{
            'name': '安全提醒',
            'description':
            '该群因涉嫌违规，已被停用'
        },
        '12':{
            'name': 'Celeste 伯特交流群',
            'description':
            '伯特交流群再也无法有2000人了...'
        },
        '13':{
            'name': '猪奥歘',
            'description':
            '猪在奥歘吗…猪在奥歘！'
        },
        '14':{
            'name': '电池',
            'description':
            '带着小小的电池在工厂里面飞呀飞呀飞~'
        },
        '15':{
            'name': '累死了鸟',
            'description':
            '被玛德琳追了好久的鸟终于可以歇一歇了，一直飞太累了……'
        },
        '16':{
            'name': '被捆绑的鸟',
            'description':
            '斯哈~斯哈~'
        },
        '17':{
            'name': '电所有人前列腺',
            'description':
            '你知道我要说什么.jpg'
        },
        '18':{
            'name': '一顶帽子',
            'description':
            '我也不知道这是哪儿来的帽子，兴许是牢古的？'
        },
        '19':{
            'name': '猫眼',
            'description':
            '别看它只是个眼睛，其实是这里最八卦的家伙。你一靠近，它就“睁”出真面目——不是发光就是放毒，一秒教你做人。没人知道它在看什么，但你敢动，它就敢炸！'
        },
        '20':{
            'name': '玛德升',
            'description':
            '玛德琳上升…'
        },
        '21':{
            'name': '烹调玛德琳',
            'description':
            '（坏德琳正在旁边偷吃草莓）'
        },
        '22':{
            'name': '黏水母',
            'description':
            '这个水母涂满了胶水，可以很轻易的粘在墙上不会掉下来'
        },
        '23':{
            'name': '黑洞',
            'description':
            '点击输入文字 （没错，文案被黑洞吸进去了）'
        },
        '24':{
            'name': 'Coaster Madeline',
            'description':
            '玛德琳客串Coaster Mountain, GD的第一个Legendary关'
        },
        '25':{
            'name': 'ReaLhecK3r',
            'description':
            '没错，RealhecK3r的真正身份就是豹猫！'
        },
        '26':{
            'name': '他紫砂了',
            'description':
            '被theo气炸'
        },
        '27':{
            'name': '资料柜',
            'description':
            '这个柜子上存放所有实验记录和资料，以及研究人员的研究日记'
        },
        '28':{
            'name': '服霸kele',
            'description':
            'kele把群服里的所有人都踢出去之后的战绩截图'
        },
        '29':{
            'name': '彩虹鮟鱇鱼',
            'description':
            '一只比飞船还大的鮟鱇鱼，可以一口闷下哈斯人的可怜小木头飞船！常出没于黑棘星内部，小小的白内障眼睛是否在暗示什么呢？'
        },
        '30':{
            'name': '铺满的棋盘',
            'description':
            '两位至尊战至棋盘边缘，大道都磨灭了。'
        },
        '31':{
            'name': '抓墙提示牌',
            'description':
            '出管道的时候按反方向，然后按抓'
        },
        '32':{
            'name': '跳跃提示牌',
            'description':
            '管道和果冻一样，都能跳出来'
        },
        '33':{
            'name': '贴吧玛德琳',
            'description':
            '小兔崽子，这是姐的吧.jpg'
        },
        '34':{
            'name': '小雕像',
            'description':
            '在深渊底部，处处矗立这一座座小石块，守护着通往神庙的大门'
        },
        '35':{
            'name': '损坏的雕像',
            'description':
            '历经百年风吹雨打，这座雕像已经失去了原来的面貌，只是依稀可见那半张图腾'
        },
        '36':{
            'name': '高型陶罐',
            'description':
            '历在祭坛台上，高高的陶罐陈列在左右两侧，守护着祭坛中央'
        },
        '37':{
            'name': '奸笑玛德琳',
            'description':
            '我说abaddon是屎：b表情'
        },
    },  
    '4':{
        '1':{
            'name': '攀岩套装',
            'description':
            'madeline可以用这个来消耗更多体力以在墙上上下爬。还可以瞬间消耗大量体力以翻越墙壁。'
        },
        '2':{
            'name': '踏空徽章',
            'description':
            '踏空徽章能让madeline在空中再次跳跃，但只能跳一次。如要再次使用，madeline必须落地或触碰充能水晶。'
        },
        '3':{
            'name': '飞花金草莓',
            'description':
            '草莓也会开花？'
        },
        '4':{
            'name': '寒冰草莓',
            'description':
            '晶莹剔透，冰凉入骨，却藏着一颗火热的挑战之心！想要摘下这颗冷艳的草莓？嘿，可没那么简单！在刺骨寒风和陡峭绝壁之间，它静静等着，考验你的操作、耐心，还有一点点疯狂！'
        },
        '5':{
            'name': 'Wingmould',
            'description':
            '欸？怎么这里也有它，它不是应该在白宫里面么？'
        },
        '6':{
            'name': '乌鸦公主',
            'description':
            '纪念碑谷的小公主，她也有属于自己的登山（？）技巧（？）'
        },
        '7':{
            'name': '绫里真宵',
            'description':
            '塞莱斯特山发生了凶杀案，坏德琳被指控将玛德琳推下山顶重伤，她此行为调查案发现场来还坏德琳一个清白'
        },
        '8':{
            'name': 'Mario',
            'description':
            "It's me! Mario!  Wahoo!"
        },
        '9':{
            'name': '神庙雕像',
            'description':
            '守护在神庙门口，展开的双翅震慑着试图侵入神庙的敌人'
        },
        '10':{
            'name': '守卫雕像',
            'description':
            '它守护着的珍宝已经找到了继承人，这座雕像矗立在这里远远的目送着继承者的背影，献上虔诚的祝愿'
        },
        '11':{
            'name': '库塔拉小兔子',
            'description':
            '在小小的花园里面……'
        },
        '12':{
            'name': '工地管理员',
            'description':
            '这个工地乱七八糟的，这管理员怎么当的？'
        },
        '13':{
            'name': '风暴行者玛德琳',
            'description':
            '当雷声滚过乌云，当闪电照耀大地，我随风暴而来，带着诸神的愤怒！'
        },
        '14':{
            'name': '浮点小猫',
            'description':
            '在反复无常的重力变化下的小猫，有着神奇的操控重力的能力'
        },
        '15':{
            'name': '浮点小狗',
            'description':
            '和浮点小猫一样，相依长大，它会指引你在交错的重力场中找到抵达目标的线路'
        },
        '16':{
            'name': '小雪人',
            'description':
            '汤姆孙博士对madeline潜在精神上治疗的锚点，让madeline在交错的突触间不迷失心智'
        },
        '17':{
            'name': 'Frisk',
            'description':
            '星星点点的光芒穿过天花板，这使你充满了决心。'
        },
        '18':{
            'name': '坏鸟苏醒',
            'description':
            '这只鸟黑化了！！'
        },
        '19':{
            'name': '笑脸砖',
            'description':
            '一块极具特色的笑脸砖，不知为何难倒了一众guess大神。\n\n小小卒：@...你猜对了！答案是：暮光之城 Dusk City。\n[图片]\n本次奖励10蓝莓'
        },
        '20':{
            'name': '害羞幽灵',
            'description':
            '呀!被看到了!'
        },
        '21':{
            'name': '电梯',
            'description':
            '带你前往另一区域的通道'
        },
        '22':{
            'name': '管道入口',
            'description':
            '神秘管道，能直接传送你到另一处地点'
        },
        '23':{
            'name': '小水晶',
            'description':
            '遗忘深渊内处处可见一簇一簇的水晶，蕴含神奇的力量'
        },
        '24':{
            'name': '水晶碎片',
            'description':
            '散落在地上的水晶碎片，逸散的魔力彰显着千年前的光辉'
        },
        '25':{
            'name': '沙堆',
            'description':
            '神庙内部，天花板已然风华，沙砾缓缓落下，已然形成了一个沙堆'
        },
        '26':{
            'name': '藤蔓',
            'description':
            '这片区域不知道存在了多久，大片的藤蔓贴在墙壁上，参差不齐'
        },
    },
    '5':{
        '1':{
            'name': '影怪',
            'description':
            '这只怪物似乎已经住在这座寺庙之中，尽管没有任何迹象表明为什么。此外它还与任何已知生物都无相似之处，找不出什么有关于它的信息。唯一可能的解释是，这个怪物来自于山脉中流动的魔力。'
        },
        '2':{
            'name': '秘海之瞳',
            'description':
            '在藤蔓虬结的遗忘神庙深处，穹顶裂隙渗入的微光如窥探之眼，映照着悬浮于祭坛残骸之上的幽蓝球体。'
        },
        '3':{
            'name': '远古灵珠',
            'description':
            '这颗散发着神秘蓝光的远古灵珠，镶嵌在黄金花瓣般的外壳中，仿佛封印着失落文明的力量。传说它拥有操控时间与空间的能力，只有真正的探险家才能解开它的秘密。'
        },
        '4':{
            'name': '幻想时间卒',
            'description':
            '现在是\n幻想时间'
        },
        '5':{
            'name': '加载卒',
            'description':
            '不是你这动画怎么加载不出来啊？（而且为什么小卒也会加载啊？）'
        },
        '6':{
            'name': 'PirateZucchini',
            'description':
            '一个幽默而古怪的船长，不过他好像不喜欢goose？'
        },
        '7':{
            'name': 'cheems',
            'description':
            '看起来平平无奇的一只柴犬，却总是以各种身份活跃在群友的视野中，是的，你甚至能看到TA正在玩guess和抓玛德琳。'
        },
        '8':{
            'name': 'TGWK',
            'description':
            'TGDR具有多重人格，目前已知的有表人格，电击人格，万万没想到，TA还有一层恶人格，就像威克一样。同时，融合了chara的真刀，恶人格具有灭世的力量（至于miku，负责可爱就行了）\n当TA赤了足够多的石之后，那层封印便会解封。\n吾名TGWK，属于吾一刀999的时代到来了。'
        },
        '9':{
            'name': 'Art Nightmare',
            'description':
            '$#?@@#¢¥£€%&$>€?'
        },
        '10':{
            'name': '火焰头',
            'description':
            '看什么呢？ 对，就是你！ 帮我把这块菠萝一样的水晶运到那边的炉子里面！快点！'
        },
        '11':{
            'name': '库塔拉小狐狸',
            'description':
            '花园里面寂静美好，小狐狸悠哉游哉的坐着'
        },
        '12':{
            'name': '钓鱼大师Zeus',
            'description':
            '又是平凡的一天，Zeus拿出了他的草莓鱼竿，打窝，甩钩，一气呵成！卧槽，是阿拉胖头鱼！'
        },
        '13':{
            'name': 'Smots Gaming',
            'description':
            'Smots Gaming Smots Gaming Smots Gaming Smots Gaming Smots Gaming\nSmots Gaming Smots Gaming Smots Gaming Smots Gaming Smots Gaming\nSmots Gaming Smots Gaming Smots Gaming Smots Gamed Smots Gaming\nSmots Gaming Smots Gaming Smots Gaming Smots Gaming Smots Gaming\nSmots Gaming Smots Gaming Smots Gaming Smots Gaming Smots Gaming'
        },
        '14':{
            'name': 'Fangame Summer Feast',
            'description':
            '国内最出名的i wanna大会，当然报名蔚蓝速通也是可以的！'
        },
        '15':{
            'name': '红温Zeus',
            'description':
            '在四猎反复被debuff 小黑屋 奸商 掉坑循环的zeus终于红温爆炸了，还有，怎么没人投稿！全是我在投稿啊！！！'
        },
        '16':{
            'name': 'pbot',
            'description':
            '抓玛抓累了也可以来养养玛哦！就是pb有点懒，中午12点还没开机……'
        },
        '17':{
            'name': 'Zeus_boom',
            'description':
            '五猎开张了！抓炸抓表抓炸抓炸抓炸启动！！ 我炸炸炸炸炸！'
        },
        '18':{
            'name': '金玛丽',
            'description':
            '抓到玛丽也算是一种抓“玛”！愿意和这位少女一起发掘“山娜菲”的秘密吗？'
        },
        '19':{
            'name': 'kidhole',
            'description':
            '这是在kid下海前，我们在他电脑里面发现的最后一张图'
        },
        '20':{
            'name': 'Lili',
            'description':
            '愿所有人不要再被那一堆钥匙所困……'
        },
        '21':{
            'name': '奥歘鸡',
            'description':
            '#表情变得十分奥歘'
        },
    }
}