###### 游戏剧情 ######

# NPC档案
npc_da = {
    
    "Desom-fu": (
# '''她是一只狐娘，并且自身也十分喜欢狐娘：“狐娘就是世界上最可爱最美好的！”
# 她本来也是抓kid资深玩家兼管理者，但是现在她似乎不怎么管理那边了。
# 而抓madeline便是她仿造抓kid打造的。
# 现在她也是抓madeline猎场的管理者。
# 她的实力深不可测……总是能抢先一步把地下的猎场给清理到相对安全……
# 不过好像最近她有点懒，新猎场的危险性明显比旧猎场危险系数高很多，而她美名其曰的说这是为了增加挑战性……'''
'''查无此人'''
    ),
    
    "Fhloy": (
'''Fhloy是抓玛德琳的双子星看板娘之一。
据说她已经跟随了Desom-fu很久了，是她手底下的一名得力干将。
不过她似乎不是一只狐娘，是只猫娘？
Desom-fu刚来的时候其实是只有他她作为抓玛德琳的看板娘的。
但是后来由于Fhloy不堪重负。累坏了，所以Desom-fu从其他地方又请来了一位看板娘。
现在轻松了一点，又是Fhloy独挑大梁了。
不过据说这两位看板娘并未同时出现过，或许……？'''
    ),
    
    "Foxeline": (
'''Foxeline是抓玛德琳的双子星看板娘之一。
她原本是未知地点狐娘玛德琳群中最好看的那只，直到那一天……
Desom-fu横空出世，直接从未知的地方跑过来一把把她给抓走了……
迫于她的银威，Foxeline只好无奈的在她家住下了。
随着时间的推移，Foxeline也逐渐熟悉了这个地方，也渐渐成为了Desom-fu手下的得力干将之一。
因此，Desom-fu决定让她也担任抓玛德琳的看板娘。
最近她似乎有点累了，所以Desom-fu让她去休息了
不过据说这两位看板娘并未同时出现过，或许……？'''
    ),
    
    "野生小卒": (
'''野生小卒是抓玛德琳游戏厅的老板娘，也是抓玛德琳的高级玩家之一。
她虽然是只猫娘，但是耳朵上总是挂着一个粉色的刺儿，没准刺儿是她的本体？
野生小卒给游戏厅设置了专门的货币——蓝莓，可以和草莓1：1兑换！
她似乎很倒霉，每次从地下猎场出来的时候总是浑身带着一身伤痕和一堆debuff……
甚至传说中，她好像使用空气都掉过坑！
大部分时候，她都是总是悠闲地趴在柜台边打盹……'''
    ),
    
    "小小卒": (
'''小小卒是抓玛德琳游戏厅的看板娘，也是野生小卒的得力助手。
她是一只活泼可爱的猫娘，总是带着灿烂的笑容迎接每一位客人。
而游戏厅内，大部分的机器都是她来保养的。
游戏厅内的guess机器广受好评，每天都有非常多的人来玩这个机器。
不过一旦有人试图在游戏厅里捣乱，她的猫耳朵会立刻竖起：“喵~ 游戏厅的规矩可不能乱哦，不然小心我用爪子挠你！”
偶尔她也会去猎场里面闲逛，不过总是灰头土脸的回来，就像小卒一样……'''
    ),
    "Pointless Machines": (
        "题目：不知所谓的机器 Pointless Machines\n"
        "出题人: Confringo\n"
        "本题价值: 500草莓\n"
        "题目描述: 不知所谓的机器上，循环播放着以下内容:\n"
        "· 1,2,4,6,9,1,3,5,...\n"
        "· 1,3,54,1140,...\n"
        "· 1,4,16,68,305,...\n"
        "· 1,6,6,14,14,18,24,...\n"
        "· 2,1,48,1,30,...\n"
        "· 1,6,7,10,11,35,...\n"
        "· 145,384,505,820,7680,...\n"
        "· 0,1,1,1,2,1,2,1,5,2,...\n"
        "· 1,2,2,2,2,1,1,1,1,3,3,2,2,...\n"
        "hint: http://oeis.org/\n"
        "请输入以下内容回答：\n.password __________"
    ),
#     "白狐": (
# '''呼呼呼~想找咱吗？咱现在没这个心情哦~别打扰咱的好事了呢~果然还是喵梦的这种可爱的叫声最好听了呢~'''
#     ),
#     "喵梦": (
# '''.喵喵呜呜！伊蕾丝，你看看这都什么人呐！快来帮我管管她，教训教训她！顺便把她的骰子都没收了！今天她藏床底下第二个柜子的第三个小格子里了！'''
#     ),
}
